# AttachedGroupNoPasteToView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..AttachedGroupNoPasteToView Property
BuiltInFailures..::..GroupFailures Class See Also
---
An attached group cannot be pasted into the selected view type and has been omitted from the elements being pasted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AttachedGroupNoPasteToView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AttachedGroupNoPasteToView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AttachedGroupNoPasteToView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace